src/Documents/РегистрацияПропусковЗанятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>РегистрацияПропусковЗанятий</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КоличествоПосещений</xr:Item>
				<xr:Item>InformationRegister.УчетПосещений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Comment>Начало месяца проведения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дисциплина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Дисциплины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокПосещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Студент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День1</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День2</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День3</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День4</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День5</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День6</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День7</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День8</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День9</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День10</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День11</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День12</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День13</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День14</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День15</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День16</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День17</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День18</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День19</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День20</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День21</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День22</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День23</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День24</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День25</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День26</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День27</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День28</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День29</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День30</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День31</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Посещаемость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныПропусков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолНеуваж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолУваж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолБолел</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолОпоздал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/Посещаемость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>Посещаемость</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>н</Name>
					<Comment>Отсутствие по неуважительной причине</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>п</Name>
					<Comment>Отсутствие по уважительной причине</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>б</Name>
					<Comment>Отсутствие по причине болезни</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>о</Name>
					<Comment>Опоздание</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/РегистрацияПропусковЗанятий/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьГруппу(Команда)
	Если ЗначениеЗаполнено(Объект.УчебнаяГруппа) Тогда
		ЗаполнитьГруппуНаСервере(Объект.УчебнаяГруппа);
	Иначе Сообщить("Группа не выбрана!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГруппуНаСервере(Группа)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Студенты.Ссылка КАК Студент,
		|	Студенты.УчебнаяГруппа КАК УчебнаяГруппа
		|ИЗ
		|	Справочник.Студенты КАК Студенты
		|ГДЕ
		|	Студенты.УчебнаяГруппа = &УчебнаяГруппа;";
	
	Запрос.УстановитьПараметр("УчебнаяГруппа", Группа);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
        НовСтр = Объект.СписокПосещения.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура СписокПосещенияДеньПриИзменении(Элемент)
	УвеличитьКолИтоги(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьКолИтоги(Знач Элемент)
	Перем Статусы;
	Статусы = ПолучитьСтатусыПосещения();
	
	Если Элемент.ТекстРедактирования = Строка(Статусы.н) Тогда
		Элементы.СписокПосещения.ТекущиеДанные.КолНеуваж = Элементы.СписокПосещения.ТекущиеДанные.КолНеуваж + 1;
	ИначеЕсли Элемент.ТекстРедактирования = Строка(Статусы.п) Тогда
		Элементы.СписокПосещения.ТекущиеДанные.КолУваж = Элементы.СписокПосещения.ТекущиеДанные.КолУваж + 1;
	ИначеЕсли Элемент.ТекстРедактирования = Строка(Статусы.б) Тогда
		Элементы.СписокПосещения.ТекущиеДанные.КолБолел = Элементы.СписокПосещения.ТекущиеДанные.КолБолел + 1;
	ИначеЕсли Элемент.ТекстРедактирования = Строка(Статусы.о) Тогда
		Элементы.СписокПосещения.ТекущиеДанные.КолОпоздал = Элементы.СписокПосещения.ТекущиеДанные.КолОпоздал + 1;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСтатусыПосещения()
	Статусы = Новый Структура;
	Статусы.Вставить("н",Перечисления.Посещаемость.н);
	Статусы.Вставить("п",Перечисления.Посещаемость.п);
	Статусы.Вставить("б",Перечисления.Посещаемость.б);
	Статусы.Вставить("о",Перечисления.Посещаемость.о);
	Возврат Статусы;
КонецФункции
